docs/version_control.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>version-control</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="orge875aa7">
<div class="navbar-brand" id="org3d13c3c">
<div class="navbar-item" id="org6373a93">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="orgfadc1f2">
<div class="navbar-start" id="org78565b1">
<div class="navbar-item" id="orgf2035c0">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org735c816">

</div>

</div>
</nav>
<div id="outline-container-org6a5403c" class="outline-2">
<h2 id="org6a5403c">Version control</h2>
<div class="outline-text-2" id="text-org6a5403c">
<p>
We have to get those dirty versions under control&#x2026;
</p>
</div>
<div id="outline-container-org5f2f39f" class="outline-3">
<h3 id="org5f2f39f"><a href="git.html#ID-bfd01242-3296-4e37-91f2-9aa2801c52fa">git</a></h3>
<div class="outline-text-3" id="text-org5f2f39f">
<ul class="org-ul">
<li>forges
<ul class="org-ul">
<li>github
<ul class="org-ul">
<li>proprietary source</li>
<li>rails app</li>
<li>bought by microsoft
<ul class="org-ul">
<li><a href="https://www.eff.org/deeplinks/2020/11/github-reinstates-youtube-dl-after-riaas-abuse-dmca">allows and enforces false DMCA take down notices</a></li>
<li><a href="https://techcrunch.com/2019/07/29/github-ban-sanctioned-countries/">banned iranian and syrian developers</a></li>
<li><a href="https://www.bleepingcomputer.com/news/security/github-suspends-accounts-of-russian-devs-at-sanctioned-companies/">banned russian developers</a> <a href="https://github.blog/2022-03-02-our-response-to-the-war-in-ukraine/">despite public statements</a></li>
<li><a href="https://nitter.net/semenov_roman_/status/1556717890308653059#m">banned developer of tornado.cash</a> and anyone who contributed code after US Treasury sanctioned</li>
<li>removes non infringing projects/mirrors without warning or take down
<ul class="org-ul">
<li>randomly removed my mirror of goldberg<sub>emulator</sub></li>
</ul></li>
<li>released copilot trained on <a href="https://twitter.com/ChrisGr93091552/status/1539731632931803137">uploaded</a> and <a href="https://twitter.com/mitsuhiko/status/1410886329924194309">scraped</a> code
<ul class="org-ul">
<li><a href="https://twitter.com/docsparse/status/1581461734665367554">copies copyrighted code verbatim</a></li>
<li>trained on <a href="https://help.openai.com/en/articles/5480054-understanding-codex-training-data-and-outputs">openai codex</a>'s lies of &gt;99% not verbatim</li>
<li>does <b>NOT</b> allow the use of gendered language or any other '<a href="https://github.com/orgs/community/discussions/20273#discussioncomment-3320989">content filtered</a>' subjects
<ul class="org-ul">
<li>The list is <a href="https://twitter.com/moyix/status/1433254293352730628">client side filtering</a> with hashes of the words</li>
</ul></li>
<li>github sued for copilot copyright violation
<ul class="org-ul">
<li>Oracle sued google over <a href="https://majadhondt.wordpress.com/2012/05/16/googles-9-lines/">9 lines</a> and got to the supreme court</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
<li>gitlab
<ul class="org-ul">
<li>rails app</li>
<li>open core</li>
<li>proposed removing 'inactive' (1 year w/o commits) free account repos to save a quarter of their costs
<ul class="org-ul">
<li>despite apparent money problems gitlab has doubled down on using ruby on rails, <a href="https://about.gitlab.com/blog/2022/07/06/why-were-sticking-with-ruby-on-rails/">despite knowing the cost</a> increase from less than stellar performance</li>
</ul></li>
<li>blocks us 'sanctioned' countries like cuba/russia etc</li>
</ul></li>
<li>sr.ht
<ul class="org-ul">
<li>mailing list based</li>
<li><a href="https://sourcehut.org/blog/2022-10-31-tos-update-cryptocurrency/">disallows cryptocurrency/blockchain projects</a></li>
</ul></li>
<li>gitea
<ul class="org-ul">
<li>federation support for forgefed (activity pub) in 1.18.0
<ul class="org-ul">
<li>init support in 1.17</li>
</ul></li>
<li>added artifact repo in 1.17</li>
<li>codeberg is a free hosted instance
<ul class="org-ul">
<li>Found to not use raid/redundant storage for hosting when investigating (data will be lost outside backup window)</li>
<li>must license software as foss (no unlicensed projects)</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>